pycom/pycom-micropython-sigfox/esp32/lte/lteppp.c
        // if we are coming from a power on reset, disable the LTE radio
        if (mpsleep_get_reset_cause() < MPSLEEP_WDT_RESET) {
            lteppp_send_at_cmd("AT+CFUN?", LTE_RX_TIMEOUT_MAX_MS);
            if (!sim_present) {
                lteppp_send_at_cmd("AT+CFUN=0", LTE_RX_TIMEOUT_MAX_MS);
            }
        }

        // enable airplane low power mode
        lteppp_send_at_cmd("AT!=\"setlpm airplane=1 enable=1\"", LTE_RX_TIMEOUT_MAX_MS);

        xSemaphoreTake(xLTESem, portMAX_DELAY);
        lteppp_modem_conn_state = E_LTE_MODEM_CONNECTED;
        xSemaphoreGive(xLTESem);
        xSemaphoreGive(xLTE_modem_Conn_Sem);

        for (;;) {
            vTaskDelay(LTE_TASK_PERIOD_MS);
            xSemaphoreTake(xLTESem, portMAX_DELAY);
            if(E_LTE_MODEM_DISCONNECTED == lteppp_modem_conn_state)
            {
                xSemaphoreGive(xLTESem);
                // restart the task
                goto modem_init;
            }
            xSemaphoreGive(xLTESem);
            if (xQueueReceive(xCmdQueue, lteppp_trx_buffer, 0)) {
                lteppp_send_at_cmd_exp(lte_task_cmd->data, lte_task_cmd->timeout, NULL, &(lte_task_rsp->data_remaining));
                xQueueSend(xRxQueue, (void *)lte_task_rsp, (TickType_t)portMAX_DELAY);
            } else {
                lte_state_t state = lteppp_get_state();
                if (state == E_LTE_PPP) {
                    uint32_t rx_len;
                    // check for IP connection
                    if(lteppp_ipv4() > 0)
                    {
                        ltepp_ppp_conn_up = true;
                    }
                    else
                    {
                        if(ltepp_ppp_conn_up == true)
                        {
                            ltepp_ppp_conn_up = false;
                            lteppp_set_state(E_LTE_ATTACHED);
                        }
                    }
                    // wait for characters received
                    uart_get_buffered_data_len(LTE_UART_ID, &rx_len);
                    if (rx_len > 0) {
                        // try to read up to the size of the buffer
                        rx_len = uart_read_bytes(LTE_UART_ID, (uint8_t *)lteppp_trx_buffer, LTE_UART_BUFFER_SIZE,
                                                 LTE_TRX_WAIT_MS(LTE_UART_BUFFER_SIZE) / portTICK_RATE_MS);
                        if (rx_len > 0) {
                            pppos_input_tcpip(lteppp_pcb, (uint8_t *)lteppp_trx_buffer, rx_len);
                        }
                    }
                }
                else
                {
                    ltepp_ppp_conn_up = false;
                }
            }
        }
    }
    goto modem_init;
}


static bool lteppp_send_at_cmd_exp (const char *cmd, uint32_t timeout, const char *expected_rsp, void* data_rem) {

    if(strstr(cmd, "Pycom_Dummy") != NULL)
    {
#ifdef LTE_DEBUG_BUFF
        if (lteppp_log.ptr < (LTE_LOG_BUFF_SIZE - strlen("[CMD]: Dummy") + 1))
        {
            memcpy(&(lteppp_log.log[lteppp_log.ptr]), "[CMD]: Dummy", strlen("[CMD]: Dummy"));
            lteppp_log.ptr += strlen("[CMD]: Dummy");
            lteppp_log.log[lteppp_log.ptr] = '\n';
            lteppp_log.ptr++;
        }
        else
        {
            lteppp_log.ptr = 0;
            lteppp_log.truncated = true;
        }
#endif
        return lteppp_wait_at_rsp(expected_rsp, timeout, false, data_rem);
    }
    else
    {
        uint32_t cmd_len = strlen(cmd);
        // char tmp_buf[128];
#ifdef LTE_DEBUG_BUFF
        if (lteppp_log.ptr < (LTE_LOG_BUFF_SIZE - strlen("[CMD]:") - cmd_len + 1))
        {
            memcpy(&(lteppp_log.log[lteppp_log.ptr]), "[CMD]:", strlen("[CMD]:"));
            lteppp_log.ptr += strlen("[CMD]:");
            memcpy(&(lteppp_log.log[lteppp_log.ptr]), cmd, cmd_len);
            lteppp_log.ptr += cmd_len;
            lteppp_log.log[lteppp_log.ptr] = '\n';
            lteppp_log.ptr++;
        }
        else
        {
            lteppp_log.ptr = 0;
            lteppp_log.truncated = true;
        }
#endif
        // flush the rx buffer first
        uart_flush(LTE_UART_ID);
        // uart_read_bytes(LTE_UART_ID, (uint8_t *)tmp_buf, sizeof(tmp_buf), 5 / portTICK_RATE_MS);
        // then send the command
        uart_write_bytes(LTE_UART_ID, cmd, cmd_len);
        if (strcmp(cmd, "+++")) {
            uart_write_bytes(LTE_UART_ID, "\r\n", 2);
        }
        uart_wait_tx_done(LTE_UART_ID, LTE_TRX_WAIT_MS(cmd_len) / portTICK_RATE_MS);
        vTaskDelay(2 / portTICK_RATE_MS);

        return lteppp_wait_at_rsp(expected_rsp, timeout, false, data_rem);
    }
}

static bool lteppp_send_at_cmd(const char *cmd, uint32_t timeout) {
    return lteppp_send_at_cmd_exp (cmd, timeout, LTE_OK_RSP, NULL);
}

static bool lteppp_check_sim_present(void) {
    lteppp_send_at_cmd("AT+CPIN?", LTE_RX_TIMEOUT_MAX_MS);
    if (strstr(lteppp_trx_buffer, "ERROR")) {
        return false;
    } else {
        return true;
    }
}

// PPP output callback
static uint32_t lteppp_output_callback(ppp_pcb *pcb, u8_t *data, u32_t len, void *ctx) {
    LWIP_UNUSED_ARG(ctx);
    uint32_t tx_bytes;
    static uint32_t top =0;
    if (lteppp_connstatus == LTE_PPP_IDLE || lteppp_connstatus == LTE_PPP_RESUMED) {
        if(top > 0 && lteppp_connstatus == LTE_PPP_RESUMED)
        {
            uart_write_bytes(LTE_UART_ID, (const char*)lteppp_queue_buffer, top+1);
            uart_wait_tx_done(LTE_UART_ID, LTE_TRX_WAIT_MS(top+1) / portTICK_RATE_MS);
        }
        top = 0;
        tx_bytes = uart_write_bytes(LTE_UART_ID, (const char*)data, len);
        uart_wait_tx_done(LTE_UART_ID, LTE_TRX_WAIT_MS(len) / portTICK_RATE_MS);
    }
    else
    {
        uint32_t temp = top + len;
        if(temp > LTE_UART_BUFFER_SIZE)
        {
            return 0;
        }
        else
        {
            memcpy(&(lteppp_queue_buffer[top]), (const char*)data, len);
            top += len;
            return len;
        }
    }
    return tx_bytes;
}

// PPP status callback
static void lteppp_status_cb (ppp_pcb *pcb, int err_code, void *ctx) {
    struct netif *pppif = ppp_netif(pcb);
    LWIP_UNUSED_ARG(ctx);

    switch (err_code) {
    case PPPERR_NONE:
//        printf("status_cb: Connected\n");
        #if PPP_IPV4_SUPPORT
        lte_gw = pppif->gw.u_addr.ip4.addr;
        lte_netmask = pppif->netmask.u_addr.ip4.addr;
        lte_ipv4addr = pppif->ip_addr.u_addr.ip4.addr;
//        printf("ipaddr    = %s\n", ipaddr_ntoa(&pppif->ip_addr));
//        printf("gateway   = %s\n", ipaddr_ntoa(&pppif->gw));
//        printf("netmask   = %s\n", ipaddr_ntoa(&pppif->netmask));
        #endif
        #if PPP_IPV6_SUPPORT
        memcpy(lte_ipv6addr.addr, netif_ip6_addr(pppif, 0), sizeof(lte_ipv4addr));
//        printf("ip6addr   = %s\n", ip6addr_ntoa(netif_ip6_addr(pppif, 0)));
        #endif
        break;
    case PPPERR_PARAM:
//        printf("status_cb: Invalid parameter\n");
        break;
    case PPPERR_OPEN:
//        printf("status_cb: Unable to open PPP session\n");
        break;
    case PPPERR_DEVICE:
//        printf("status_cb: Invalid I/O device for PPP\n");
        break;
    case PPPERR_ALLOC:
//        printf("status_cb: Unable to allocate resources\n");
        break;
    case PPPERR_USER:
//        printf("status_cb: User interrupt (disconnected)\n");
        lte_ipv4addr = 0;
        memset(lte_ipv6addr.addr, 0, sizeof(lte_ipv4addr));
        break;
    case PPPERR_CONNECT:
//        printf("status_cb: Connection lost\n");
        lte_ipv4addr = 0;
        memset(lte_ipv6addr.addr, 0, sizeof(lte_ipv4addr));
        break;
    case PPPERR_AUTHFAIL:
//        printf("status_cb: Failed authentication challenge\n");
        break;
    case PPPERR_PROTOCOL:
//        printf("status_cb: Failed to meet protocol\n");
        break;
    case PPPERR_PEERDEAD:
//        printf("status_cb: Connection timeout\n");
        break;
    case PPPERR_IDLETIMEOUT:
//        printf("status_cb: Idle Timeout\n");
        break;
    case PPPERR_CONNECTTIME:
//        printf("status_cb: Max connect time reached\n");
        break;
    case PPPERR_LOOPBACK:
//        printf("status_cb: Loopback detected\n");
        break;
    default:
//        printf("status_cb: Unknown error code %d\n", err_code);
        lte_ipv4addr = 0;
        memset(lte_ipv6addr.addr, 0, sizeof(lte_ipv4addr));
        break;
    }
}
